test/multipleBodies/twoFreeBoxes2D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            noSlip;
    }
    outlet
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    floatingObject
    {
        type            floaterVelocity;
        slip            yes;
        value           uniform (0 0 0);
    }
    floatingObject2
    {
//        type            noSlip;
        type            floaterVelocity;
        slip            yes;
        value           uniform (0 0 0);

    }
}


// ************************************************************************* //
